XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ3Aplus-M3H1_DFP.pdsc
        <!-- ***********************  Device 'TMPM3HLFYAUG'  ************************* -->
        <device Dname="TMPM3HLFYAUG">
          <processor Dclock="120000000"/>
          <compile header="Device/Include/TMPM3HLA.h" define="TMPM3HLA"/>
          <debug svd="SVD/M3HLA.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_256.FLM"  start="0x00000000" size="0x00040000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"   RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="57"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="12"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="12"                          name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="53"                          name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="8"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="7"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit Version A(EI2C)"/>
          <feature type="SPI"           n="1"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="12"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="105"/>
          <feature type="QFP"           n="64"                         name="P-LQFP64-1010- 0.50-003"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM3HxA Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3HQx CMSIS">
      <description>Toshiba TMPM3HQx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HQ*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM3HPx CMSIS">
      <description>Toshiba TMPM3HPx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HP*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM3HNx CMSIS">
      <description>Toshiba TMPM3HNx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HN*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM3HMx CMSIS">
      <description>Toshiba TMPM3HMx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HM*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM3HLx CMSIS">
      <description>Toshiba TMPM3HLx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HL*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>

    <!-- Startup TMPM3HQx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM3HQx CMSIS">
      <description>System Startup for Toshiba TMPM3HQx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3HxA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HQA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HQA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3HxA.c"      attr="config" version="1.0.0" condition="TMPM3HxA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HPx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM3HPx CMSIS">
      <description>System Startup for Toshiba TMPM3HPx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3HxA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HPA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HPA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3HxA.c"      attr="config" version="1.0.0" condition="TMPM3HxA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HNx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM3HNx CMSIS">
      <description>System Startup for Toshiba TMPM3HNx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3HxA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HNA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HNA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3HxA.c"      attr="config" version="1.0.0" condition="TMPM3HxA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HMx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM3HMx CMSIS">
      <description>System Startup for Toshiba TMPM3HMx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3HxA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HMA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HMA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3HxA.c"      attr="config" version="1.0.0" condition="TMPM3HxA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HLx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM3HLx CMSIS">
      <description>System Startup for Toshiba TMPM3HLx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3HxA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HLA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HLA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3HxA.c"      attr="config" version="1.0.0" condition="TMPM3HxA Compiler"/>
      </files>
    </component>

  </components>

</package>
